Repository: PauloGoncalvesDev/api-brazilian-addresses
Catalog: src/Shared/BrazilianAddresses.Exceptions/ResourcesMessage/APIMSG.*.resx
Languages: pt

# BLANK_PAGE
source: Blank page, no more records. Go back a page or reduce the number of records per page.
pt: Página em branco, sem mais registros. Volte uma página ou reduza o número de registros por página.

# EMPTY_CITY
source: 'City' is a required field.
pt: 'City' é um campo obrigatório.

# EMPTY_EMAIL
source: 'Email' is a required field.
pt: 'Email' é um campo obrigatório.

# EMPTY_IBGECODE
source: 'IBGECode' is a required field.
pt: 'IBGECode' é um campo obrigatório.

# EMPTY_PAGEINDEX
source: 'PageIndex' is a required field.
pt: 'PageIndex' é um campo obrigatório.

# EMPTY_PAGESIZE
source: 'PageSize' is a required field.
pt: 'PageSize' é um campo obrigatório.

# EMPTY_PASSWORD
source: 'Password' is a required field.
pt: 'Password' é um campo obrigatório.

# EMPTY_STATE
source: 'State' is a required field.
pt: 'State' é um campo obrigatório.

# EMPTY_USERROLE
source: 'UserRole' is a required field.
pt: 'UserRole' é um campo obrigatório.

# EXISTING_CODE
source: The city code entered is already registered.
pt: O código de município informado já está registrado.

# EXISTING_EMAIL
source: Already exists a User with this e-mail {0}.
pt: Já existe um usuário com este e-mail {0}.

# IBGE_CREATED
source: Location entered was successfully registered.
pt: Localidade informada foi registrada com sucesso.

# IBGE_REMOVED
source: Location informed was successfully removed.
pt: Localidade informada foi removida com sucesso.

# INDEX_TOO_LARGE
source: The page index value is too large. Please enter an integer value between 0 and {0}.
pt: O valor do índice da página é muito grande. Por favor insira um valor inteiro entre 0 e {0}.

# INVALID_CITY
source: City entered is not valid.
pt: Cidade informada não é válida.

# INVALID_CODE
source: City code entered is not valid.
pt: Código de município informado não é válido.

# INVALID_EMAIL
source: Email informed is invalid.
pt: O campo e-mail está inválido.

# INVALID_PAGEINDEX
source: PageIndex entered value is not valid.
pt: O valor inserido no PageIndex não é válido.

# INVALID_PAGESIZE
source: PageSize entered value is not valid.
pt: O valor inserido no PageSize não é válido.

# INVALID_STATE
source: The state reported does not exist.
pt: O estado informado não existe.

# INVALID_USERROLE
source: UserRole informed is not valid.
pt: O campo UserRole está inválido.

# LENGTH_PASSWORD
source: Password must have at least size {0}.
pt: A senha deve ter pelo menos tamanho {0}.

# LISTING_COMPLETED
source: Listing completed successfully.
pt: Listagem de endereços concluída com sucesso.

# NO_EXISTING_CITY
source: The city entered is not registered.
pt: A cidade informada não está registrada.

# LOGIN_COMPLETED
source: Login successfully completed.
pt: Login efetuado com sucesso.

# LOGIN_ERROR
source: Email or password is incorrect.
pt: Email ou senha estão incorretos.

# NO_EXISTING_CODE
source: The city code entered is not registered.
pt: O código de município informado não está registrado.

source: Unknow error.
pt: Erro desconhecido.

# UPDATED_IBGE
source: Requested information has been successfully updated.
pt: Informações solicitadas foram atualizadas com sucesso.

# USER_CREATED
source: User created successfully.
pt: Usuário criado com sucesso.

# TOKEN_EXPIRED
source: Token is expired.
pt: Token está expirado.

# USER_UNAUTHORIZED
source: User is not authorized to access the method.
pt: Usuário não possui autorização para acessar o método.
